package com.lab3.data

import com.lab3.R

object ItemsData {
    val itemsList = listOf(
        Item(
            1,
            "Фіорд Гейрангер",
            "Фіорд Гейрангер — Перлина ЮНЕСКО",
            "Один із найвідоміших фіордів Норвегії, включений до списку Світової спадщини ЮНЕСКО. Цей мальовничий фіорд оточений високими горами, кришталево чистими водами та численними водоспадами, такими як «Сім сестер».",
            image= R.drawable.geyranger
        ),
        Item(
            2,
            "Троллтунга",
            "Троллтунга — Язик троля",
            "«Язик троля» — це одна з найзахопливіших природних скель Норвегії. Скеля височіє на 700 метрів над озером Рінгедалсватнет і створює ілюзію, ніби зависає в повітрі. Це ідеальне місце для любителів пригод та фотографій.",
            R.drawable.trollunga
        ),
        Item(
            3,
            "Лофотенські острови",
            "Лофотенські острови — Магія Півночі",
            "Архіпелаг на півночі Норвегії славиться своїми драматичними гірськими пейзажами, мальовничими рибальськими селами й чудовими пляжами. Взимку тут можна побачити північне сяйво, а влітку — насолодитися опівнічним сонцем.",
            R.drawable.lofotensk
        ),
        Item(
            4,
            "Бергeн і Брюгген",
            "Брюгген у Бергені — Історичний спадок Ганзи",
            "Берген — це «ворота до фіордів» і друге за величиною місто Норвегії. Його історичний район Брюгген (внесений до списку ЮНЕСКО) славиться старими дерев'яними будинками, які колись були частиною торгової Ганзейської ліги.",
             R.drawable.bruggen
        ),
        Item(
            5,
            "Преєкстолен",
            "Преєкстолен — Кафедра проповідника",
            "«Кафедра проповідника» — це пласка скеля, що піднімається на 604 метри над Люсефіордом. Вона є однією з найпопулярніших туристичних атракцій у Норвегії завдяки своїм неймовірним краєвидам.",
             R.drawable.preikestolen
        )
    )
}

class Item(val id: Int, val name: String, val title: String, val description: String, val image: Int)
